Tekla.Structures.Geometry3d.MatrixFactory.Rotate(System.Double,Tekla.Structures.Geometry3d.Vector)
Returns a rotation matrix defined by the given angle
and the given rotation axis.
Angle: The rotation angle (in radians).
Axis: The rotation axis.
Returns: The new rotation matrix.